//1 选择购票种类
/*
 思路：
 1）定义变量保存用户选择的结果
 2）提示信息，让用户选择
 3）分别定义两个函数，购买电影票和演唱会票
 4）在函数中创建电影院对象，调用购票方法
 */

//2 显示最新上映的影片信息
/*
 思路：
 1）重写电影院类的构造方法
 2）初始化影片的数组
 3）通过for循环遍历数组，显示所有影片信息
 */

//3 选择影片
/*
 思路：
 1）选择影片编号
 2）保存选择的影片信息
 */

//4 选择座位信息
/*
 思路：
 1）初始化座位信息
 2）显示座位信息
 3）选择排数
 4）选择座位数
 5）购票再次确认
 */

//5 打印电影票
/*
 思路：
 1）提示购票成功
 2）打印购票信息
 3）显示座位信息
 */


//需要创建的类 1电影院类（影厅 影院名称）（行为：买票 查看票 选票 选座 支付 出票）。2电影票类（价格）。3common（时长，导演，演员，片名，简介，编号）4票类（排 座 地点）
#import <Foundation/Foundation.h>

int main(int argc, const char * argv[]) {
    @autoreleasepool {
        // insert code here...
        NSLog(@"Hello, World!");
    }
    return 0;
}
